*** src/descriptor.rs:37:5: replace descriptor_tag -> u64 with 1

*** mutation diff:
--- src/descriptor.rs
+++ replace descriptor_tag -> u64 with 1
@@ -29,17 +29,17 @@
     payload
         .get(o..o + 8)
         .map(|b| u64::from_le_bytes(b.try_into().unwrap()))
         .unwrap_or(0)
 }
 
 /// Word 0: the per-capture descriptor tag shared by every descriptor struct.
 pub(crate) fn descriptor_tag(payload: &[u8]) -> u64 {
-    word(payload, 0)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn parse_descriptor(payload: &[u8], store0_offset: u64) -> TextureDescriptor {
     TextureDescriptor {
         store0_offset,
         texture_type: word(payload, 1) as u32,
         format: word(payload, 2) as u32,
         width: word(payload, 3) as u32,

---- descriptor::tests::parses_the_word_map stdout ----

thread 'descriptor::tests::parses_the_word_map' (13067908) panicked at src/descriptor.rs:108:9:
assertion `left == right` failed
  left: 1
 right: 225

failures:
    descriptor::tests::parses_the_word_map

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
