*** src/descriptor.rs:59:5: replace derive_tag -> Option<u64> with Some(0)

*** mutation diff:
--- src/descriptor.rs
+++ replace derive_tag -> Option<u64> with Some(0)
@@ -51,23 +51,17 @@
         usage: word(payload, 11),
         texture_id: word(payload, 17),
     }
 }
 
 /// The capture's descriptor tag: the most common word-0 value among the
 /// 248-byte payloads. `None` when there are none.
 pub(crate) fn derive_tag(word0s: &[u64]) -> Option<u64> {
-    let mut votes: HashMap<u64, usize> = HashMap::new();
-    for &w in word0s {
-        *votes.entry(w).or_default() += 1;
-    }
-    // Ties are broken by the tag value (the larger wins), so the result is
-    // deterministic rather than dependent on HashMap iteration order.
-    votes.into_iter().max_by_key(|&(w, n)| (n, w)).map(|(w, _)| w)
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     // Build a synthetic 248-byte descriptor: 31 LE u64 words, tag at word 0.
     fn desc(tag: u64, fields: &[(usize, u64)]) -> Vec<u8> {

---- descriptor::tests::derives_the_modal_tag stdout ----

thread 'descriptor::tests::derives_the_modal_tag' (13068820) panicked at src/descriptor.rs:113:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(225)

failures:
    descriptor::tests::derives_the_modal_tag

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
