*** src/descriptor.rs:61:38: replace += with *= in derive_tag

*** mutation diff:
--- src/descriptor.rs
+++ replace += with *= in derive_tag
@@ -53,17 +53,17 @@
     }
 }
 
 /// The capture's descriptor tag: the most common word-0 value among the
 /// 248-byte payloads. `None` when there are none.
 pub(crate) fn derive_tag(word0s: &[u64]) -> Option<u64> {
     let mut votes: HashMap<u64, usize> = HashMap::new();
     for &w in word0s {
-        *votes.entry(w).or_default() += 1;
+        *votes.entry(w).or_default() *= /* ~ changed by cargo-mutants ~ */ 1;
     }
     // Ties are broken by the tag value (the larger wins), so the result is
     // deterministic rather than dependent on HashMap iteration order.
     votes.into_iter().max_by_key(|&(w, n)| (n, w)).map(|(w, _)| w)
 }
 
 #[cfg(test)]
 mod tests {

---- descriptor::tests::derives_the_modal_tag stdout ----

thread 'descriptor::tests::derives_the_modal_tag' (13070275) panicked at src/descriptor.rs:119:9:
assertion `left == right` failed
  left: Some(255)
 right: Some(225)

failures:
    descriptor::tests::derives_the_modal_tag

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
