*** src/index.rs:100:9: replace Buckets::canonical -> usize with 1

*** mutation diff:
--- src/index.rs
+++ replace Buckets::canonical -> usize with 1
@@ -92,17 +92,17 @@
             seen[ti] = true;
             canonical[ti] = canon;
         }
         Some(Buckets { canonical })
     }
 
     /// The record holding `id`'s bytes (itself when not aliased).
     pub fn canonical(&self, id: usize) -> usize {
-        self.canonical.get(id).map(|&c| c as usize).unwrap_or(id)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     // Header: xdic magic, then u32 words. word2 = bucket count, word3 = record

---- index::tests::bucket_table_maps_alias_to_canonical stdout ----

thread 'index::tests::bucket_table_maps_alias_to_canonical' (13086830) panicked at src/index.rs:170:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    index::tests::bucket_table_maps_alias_to_canonical

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
