*** src/index.rs:21:23: replace != with == in Header::parse

*** mutation diff:
--- src/index.rs
+++ replace != with == in Header::parse
@@ -13,17 +13,17 @@
     pub record_count: u32,
 }
 
 impl Header {
     pub fn parse(index: &[u8]) -> Result<Header, Error> {
         let head = index
             .get(..HEADER_LEN)
             .ok_or(Error::BadIndex("index shorter than header"))?;
-        if &head[..4] != XDIC_MAGIC {
+        if &head[..4] == /* ~ changed by cargo-mutants ~ */ XDIC_MAGIC {
             return Err(Error::BadIndex("bad xdic magic"));
         }
         let word = |i: usize| u32::from_le_bytes(head[i * 4..i * 4 + 4].try_into().unwrap());
         Ok(Header {
             bucket_count: word(2),
             record_count: word(3),
         })
     }

---- index::tests::parses_header_and_record_offset stdout ----

thread 'index::tests::parses_header_and_record_offset' (13070856) panicked at src/index.rs:122:53:
called `Result::unwrap()` on an `Err` value: BadIndex("bad xdic magic")

---- index::tests::rejects_foreign_magic stdout ----

thread 'index::tests::rejects_foreign_magic' (13070857) panicked at src/index.rs:132:9:
assertion failed: Header::parse(&b).is_err()

---- index::tests::a_partially_empty_bucket_is_rejected_not_skipped stdout ----

thread 'index::tests::a_partially_empty_bucket_is_rejected_not_skipped' (13070852) panicked at src/index.rs:192:57:
called `Result::unwrap()` on an `Err` value: BadIndex("bad xdic magic")

failures:
    index::tests::a_partially_empty_bucket_is_rejected_not_skipped
    index::tests::bucket_table_maps_alias_to_canonical
    index::tests::invalid_bucket_table_is_absent
    index::tests::parses_header_and_record_offset
    index::tests::rejects_foreign_magic

test result: FAILED. 6 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
