*** src/index.rs:24:64: replace * with + in Header::parse

*** mutation diff:
--- src/index.rs
+++ replace * with + in Header::parse
@@ -16,17 +16,17 @@
 impl Header {
     pub fn parse(index: &[u8]) -> Result<Header, Error> {
         let head = index
             .get(..HEADER_LEN)
             .ok_or(Error::BadIndex("index shorter than header"))?;
         if &head[..4] != XDIC_MAGIC {
             return Err(Error::BadIndex("bad xdic magic"));
         }
-        let word = |i: usize| u32::from_le_bytes(head[i * 4..i * 4 + 4].try_into().unwrap());
+        let word = |i: usize| u32::from_le_bytes(head[i * 4..i + /* ~ changed by cargo-mutants ~ */ 4 + 4].try_into().unwrap());
         Ok(Header {
             bucket_count: word(2),
             record_count: word(3),
         })
     }
 
     /// The record array begins after the header and the bucket table.
     pub fn record_array_offset(&self) -> Result<usize, Error> {

---- index::tests::parses_header_and_record_offset stdout ----

thread 'index::tests::parses_header_and_record_offset' (13073242) panicked at src/index.rs:24:119:
called `Result::unwrap()` on an `Err` value: TryFromSliceError(())

---- index::tests::invalid_bucket_table_is_absent stdout ----

thread 'index::tests::invalid_bucket_table_is_absent' (13073240) panicked at src/index.rs:24:119:
called `Result::unwrap()` on an `Err` value: TryFromSliceError(())

---- index::tests::a_partially_empty_bucket_is_rejected_not_skipped stdout ----

thread 'index::tests::a_partially_empty_bucket_is_rejected_not_skipped' (13073238) panicked at src/index.rs:24:119:
called `Result::unwrap()` on an `Err` value: TryFromSliceError(())

failures:
    index::tests::a_partially_empty_bucket_is_rejected_not_skipped
    index::tests::bucket_table_maps_alias_to_canonical
    index::tests::invalid_bucket_table_is_absent
    index::tests::parses_header_and_record_offset

test result: FAILED. 7 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
