*** src/index.rs:33:9: replace Header::record_array_offset -> Result<usize, Error> with Ok(0)

*** mutation diff:
--- src/index.rs
+++ replace Header::record_array_offset -> Result<usize, Error> with Ok(0)
@@ -25,20 +25,17 @@
         Ok(Header {
             bucket_count: word(2),
             record_count: word(3),
         })
     }
 
     /// The record array begins after the header and the bucket table.
     pub fn record_array_offset(&self) -> Result<usize, Error> {
-        (self.bucket_count as usize)
-            .checked_mul(BUCKET_SIZE)
-            .and_then(|b| b.checked_add(HEADER_LEN))
-            .ok_or(Error::BadIndex("record array offset overflow"))
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) struct Record {
     pub usize_len: u32,
     pub csize: u32,
     pub store0_offset: u64,
 }

---- index::tests::parses_header_and_record_offset stdout ----

thread 'index::tests::parses_header_and_record_offset' (13074205) panicked at src/index.rs:122:9:
assertion `left == right` failed
  left: 0
 right: 116

failures:
    index::tests::parses_header_and_record_offset

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
