*** src/index.rs:48:9: replace Record::parse_at -> Option<Record> with None

*** mutation diff:
--- src/index.rs
+++ replace Record::parse_at -> Option<Record> with None
@@ -40,22 +40,17 @@
 pub(crate) struct Record {
     pub usize_len: u32,
     pub csize: u32,
     pub store0_offset: u64,
 }
 
 impl Record {
     pub fn parse_at(index: &[u8], off: usize) -> Option<Record> {
-        let b = index.get(off..off.checked_add(RECORD_SIZE)?)?;
-        Some(Record {
-            usize_len: u32::from_le_bytes(b[0..4].try_into().unwrap()),
-            csize: u32::from_le_bytes(b[4..8].try_into().unwrap()),
-            store0_offset: u64::from_le_bytes(b[8..16].try_into().unwrap()),
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// An alias carries a marker where an extent would be: `store0_offset == 0`
     /// and `csize == this record's own index`. Its bytes live in a canonical
     /// record reached via the bucket table.
     pub fn is_alias(&self, id: usize) -> bool {
         self.store0_offset == 0 && self.csize as usize == id
     }

---- index::tests::parses_a_record_and_detects_alias stdout ----

thread 'index::tests::parses_a_record_and_detects_alias' (13075177) panicked at src/index.rs:138:43:
called `Option::unwrap()` on a `None` value

failures:
    index::tests::parses_a_record_and_detects_alias

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
