*** src/index.rs:60:33: replace && with || in Record::is_alias

*** mutation diff:
--- src/index.rs
+++ replace && with || in Record::is_alias
@@ -52,17 +52,17 @@
             store0_offset: u64::from_le_bytes(b[8..16].try_into().unwrap()),
         })
     }
 
     /// An alias carries a marker where an extent would be: `store0_offset == 0`
     /// and `csize == this record's own index`. Its bytes live in a canonical
     /// record reached via the bucket table.
     pub fn is_alias(&self, id: usize) -> bool {
-        self.store0_offset == 0 && self.csize as usize == id
+        self.store0_offset == 0 || /* ~ changed by cargo-mutants ~ */ self.csize as usize == id
     }
 }
 
 /// Open-addressed hash table mapping each record to the record that actually
 /// holds its bytes. Absent (`None`) when the table fails validation, in which
 /// case every non-alias record is still usable.
 pub(crate) struct Buckets {
     canonical: Vec<u32>,

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13076690) panicked at tests/parse.rs:200:5:
assertion `left == right` failed
  left: 0
 right: 1

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13076688) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 2
 right: 3

failures:
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
