*** src/index.rs:60:9: replace Record::is_alias -> bool with true

*** mutation diff:
--- src/index.rs
+++ replace Record::is_alias -> bool with true
@@ -52,17 +52,17 @@
             store0_offset: u64::from_le_bytes(b[8..16].try_into().unwrap()),
         })
     }
 
     /// An alias carries a marker where an extent would be: `store0_offset == 0`
     /// and `csize == this record's own index`. Its bytes live in a canonical
     /// record reached via the bucket table.
     pub fn is_alias(&self, id: usize) -> bool {
-        self.store0_offset == 0 && self.csize as usize == id
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Open-addressed hash table mapping each record to the record that actually
 /// holds its bytes. Absent (`None`) when the table fails validation, in which
 /// case every non-alias record is still usable.
 pub(crate) struct Buckets {
     canonical: Vec<u32>,

---- index::tests::parses_a_record_and_detects_alias stdout ----

thread 'index::tests::parses_a_record_and_detects_alias' (13075709) panicked at src/index.rs:148:9:
assertion failed: !rec.is_alias(0)

failures:
    index::tests::parses_a_record_and_detects_alias

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
