*** src/index.rs:73:9: replace Buckets::build -> Option<Buckets> with None

*** mutation diff:
--- src/index.rs
+++ replace Buckets::build -> Option<Buckets> with None
@@ -65,39 +65,17 @@
 /// holds its bytes. Absent (`None`) when the table fails validation, in which
 /// case every non-alias record is still usable.
 pub(crate) struct Buckets {
     canonical: Vec<u32>,
 }
 
 impl Buckets {
     pub fn build(index: &[u8], header: &Header) -> Option<Buckets> {
-        let n = header.record_count as usize;
-        let mut canonical: Vec<u32> = (0..header.record_count).collect();
-        let mut seen = vec![false; n];
-        for k in 0..header.bucket_count as usize {
-            let at = HEADER_LEN + k * BUCKET_SIZE;
-            let b = index.get(at..at + BUCKET_SIZE)?;
-            let canon = u32::from_le_bytes(b[0..4].try_into().unwrap());
-            let this = u32::from_le_bytes(b[4..8].try_into().unwrap());
-            let third = u32::from_le_bytes(b[8..12].try_into().unwrap());
-            if canon == EMPTY && this == EMPTY && third == EMPTY {
-                continue;
-            }
-            if third != EMPTY {
-                return None; // occupied buckets always carry the 0xFFFFFFFF marker
-            }
-            let (ti, ci) = (this as usize, canon as usize);
-            if ti >= n || ci >= n || seen[ti] {
-                return None; // out of range, or two buckets claim one record
-            }
-            seen[ti] = true;
-            canonical[ti] = canon;
-        }
-        Some(Buckets { canonical })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The record holding `id`'s bytes (itself when not aliased).
     pub fn canonical(&self, id: usize) -> usize {
         self.canonical.get(id).map(|&c| c as usize).unwrap_or(id)
     }
 }

---- index::tests::bucket_table_maps_alias_to_canonical stdout ----

thread 'index::tests::bucket_table_maps_alias_to_canonical' (13078105) panicked at src/index.rs:147:55:
called `Option::unwrap()` on a `None` value

failures:
    index::tests::bucket_table_maps_alias_to_canonical

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
