*** src/index.rs:78:38: replace + with - in Buckets::build

*** mutation diff:
--- src/index.rs
+++ replace + with - in Buckets::build
@@ -70,17 +70,17 @@
 
 impl Buckets {
     pub fn build(index: &[u8], header: &Header) -> Option<Buckets> {
         let n = header.record_count as usize;
         let mut canonical: Vec<u32> = (0..header.record_count).collect();
         let mut seen = vec![false; n];
         for k in 0..header.bucket_count as usize {
             let at = HEADER_LEN + k * BUCKET_SIZE;
-            let b = index.get(at..at + BUCKET_SIZE)?;
+            let b = index.get(at..at - /* ~ changed by cargo-mutants ~ */ BUCKET_SIZE)?;
             let canon = u32::from_le_bytes(b[0..4].try_into().unwrap());
             let this = u32::from_le_bytes(b[4..8].try_into().unwrap());
             let third = u32::from_le_bytes(b[8..12].try_into().unwrap());
             if canon == EMPTY && this == EMPTY && third == EMPTY {
                 continue;
             }
             if third != EMPTY {
                 return None; // occupied buckets always carry the 0xFFFFFFFF marker

---- index::tests::bucket_table_maps_alias_to_canonical stdout ----

thread 'index::tests::bucket_table_maps_alias_to_canonical' (13080558) panicked at src/index.rs:169:55:
called `Option::unwrap()` on a `None` value

failures:
    index::tests::bucket_table_maps_alias_to_canonical

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
