*** src/index.rs:82:48: replace && with || in Buckets::build

*** mutation diff:
--- src/index.rs
+++ replace && with || in Buckets::build
@@ -74,17 +74,17 @@
         let mut canonical: Vec<u32> = (0..header.record_count).collect();
         let mut seen = vec![false; n];
         for k in 0..header.bucket_count as usize {
             let at = HEADER_LEN + k * BUCKET_SIZE;
             let b = index.get(at..at + BUCKET_SIZE)?;
             let canon = u32::from_le_bytes(b[0..4].try_into().unwrap());
             let this = u32::from_le_bytes(b[4..8].try_into().unwrap());
             let third = u32::from_le_bytes(b[8..12].try_into().unwrap());
-            if canon == EMPTY && this == EMPTY && third == EMPTY {
+            if canon == EMPTY && this == EMPTY || /* ~ changed by cargo-mutants ~ */ third == EMPTY {
                 continue;
             }
             if third != EMPTY {
                 return None; // occupied buckets always carry the 0xFFFFFFFF marker
             }
             let (ti, ci) = (this as usize, canon as usize);
             if ti >= n || ci >= n || seen[ti] {
                 return None; // out of range, or two buckets claim one record

---- index::tests::a_partially_empty_bucket_is_rejected_not_skipped stdout ----

thread 'index::tests::a_partially_empty_bucket_is_rejected_not_skipped' (13081520) panicked at src/index.rs:197:9:
assertion failed: Buckets::build(&index, &header).is_none()

---- index::tests::invalid_bucket_table_is_absent stdout ----

thread 'index::tests::invalid_bucket_table_is_absent' (13081522) panicked at src/index.rs:183:9:
assertion failed: Buckets::build(&index, &header).is_none()

---- index::tests::bucket_table_maps_alias_to_canonical stdout ----

thread 'index::tests::bucket_table_maps_alias_to_canonical' (13081521) panicked at src/index.rs:170:9:
assertion `left == right` failed
  left: 6
 right: 2

failures:
    index::tests::a_partially_empty_bucket_is_rejected_not_skipped
    index::tests::bucket_table_maps_alias_to_canonical
    index::tests::invalid_bucket_table_is_absent

test result: FAILED. 8 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
