*** src/index.rs:89:19: replace >= with < in Buckets::build

*** mutation diff:
--- src/index.rs
+++ replace >= with < in Buckets::build
@@ -81,17 +81,17 @@
             let third = u32::from_le_bytes(b[8..12].try_into().unwrap());
             if canon == EMPTY && this == EMPTY && third == EMPTY {
                 continue;
             }
             if third != EMPTY {
                 return None; // occupied buckets always carry the 0xFFFFFFFF marker
             }
             let (ti, ci) = (this as usize, canon as usize);
-            if ti >= n || ci >= n || seen[ti] {
+            if ti < /* ~ changed by cargo-mutants ~ */ n || ci >= n || seen[ti] {
                 return None; // out of range, or two buckets claim one record
             }
             seen[ti] = true;
             canonical[ti] = canon;
         }
         Some(Buckets { canonical })
     }

---- index::tests::bucket_table_maps_alias_to_canonical stdout ----

thread 'index::tests::bucket_table_maps_alias_to_canonical' (13085406) panicked at src/index.rs:169:55:
called `Option::unwrap()` on a `None` value

failures:
    index::tests::bucket_table_maps_alias_to_canonical

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
