*** src/index.rs:89:24: replace || with && in Buckets::build

*** mutation diff:
--- src/index.rs
+++ replace || with && in Buckets::build
@@ -81,17 +81,17 @@
             let third = u32::from_le_bytes(b[8..12].try_into().unwrap());
             if canon == EMPTY && this == EMPTY && third == EMPTY {
                 continue;
             }
             if third != EMPTY {
                 return None; // occupied buckets always carry the 0xFFFFFFFF marker
             }
             let (ti, ci) = (this as usize, canon as usize);
-            if ti >= n || ci >= n || seen[ti] {
+            if ti >= n && /* ~ changed by cargo-mutants ~ */ ci >= n || seen[ti] {
                 return None; // out of range, or two buckets claim one record
             }
             seen[ti] = true;
             canonical[ti] = canon;
         }
         Some(Buckets { canonical })
     }

---- index::tests::a_partially_empty_bucket_is_rejected_not_skipped stdout ----

thread 'index::tests::a_partially_empty_bucket_is_rejected_not_skipped' (13084872) panicked at src/index.rs:197:9:
assertion failed: Buckets::build(&index, &header).is_none()

---- index::tests::invalid_bucket_table_is_absent stdout ----

thread 'index::tests::invalid_bucket_table_is_absent' (13084874) panicked at src/index.rs:183:9:
assertion failed: Buckets::build(&index, &header).is_none()

failures:
    index::tests::a_partially_empty_bucket_is_rejected_not_skipped
    index::tests::invalid_bucket_table_is_absent

test result: FAILED. 9 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
