*** src/lib.rs:107:54: replace == with != in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace == with != in Bundle::open
@@ -99,17 +99,17 @@
         let tag = derive_tag(
             &payloads
                 .iter()
                 .map(|(_, p)| descriptor_tag(p))
                 .collect::<Vec<_>>(),
         );
         let mut textures: Vec<TextureDescriptor> = payloads
             .iter()
-            .filter(|(_, p)| Some(descriptor_tag(p)) == tag)
+            .filter(|(_, p)| Some(descriptor_tag(p)) != /* ~ changed by cargo-mutants ~ */ tag)
             .map(|(off, p)| parse_descriptor(p, *off))
             .collect();
         textures.sort_by_key(|d| d.store0_offset);
 
         let name = path
             .file_stem()
             .and_then(|s| s.to_str())
             .unwrap_or("trace")

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13059417) panicked at tests/parse.rs:200:5:
assertion `left == right` failed
  left: 0
 right: 1

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13059415) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
