*** src/lib.rs:123:9: replace Bundle::textures -> &[TextureDescriptor] with Vec::leak(Vec::new())

*** mutation diff:
--- src/lib.rs
+++ replace Bundle::textures -> &[TextureDescriptor] with Vec::leak(Vec::new())
@@ -115,17 +115,17 @@
             .unwrap_or("trace")
             .to_string();
         Ok(Bundle { name, textures })
     }
 
     /// Texture descriptors, sorted by `store0_offset` ascending (the bridge
     /// order that corresponds rank-for-rank with ascending fetch streamRefs).
     pub fn textures(&self) -> &[TextureDescriptor] {
-        &self.textures
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn texture_count(&self) -> usize {
         self.textures.len()
     }
 
     pub fn name(&self) -> &str {
         &self.name

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13059881) panicked at tests/parse.rs:84:16:
index out of bounds: the len is 0 but the index is 0

failures:
    opens_parses_resolves_alias_and_sorts

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
