*** src/lib.rs:127:9: replace Bundle::texture_count -> usize with 0

*** mutation diff:
--- src/lib.rs
+++ replace Bundle::texture_count -> usize with 0
@@ -119,17 +119,17 @@
 
     /// Texture descriptors, sorted by `store0_offset` ascending (the bridge
     /// order that corresponds rank-for-rank with ascending fetch streamRefs).
     pub fn textures(&self) -> &[TextureDescriptor] {
         &self.textures
     }
 
     pub fn texture_count(&self) -> usize {
-        self.textures.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn name(&self) -> &str {
         &self.name
     }
 }
 
 fn read_member(dir: &Path, member: &'static str) -> Result<Vec<u8>, Error> {

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13060431) panicked at tests/parse.rs:200:5:
assertion `left == right` failed
  left: 0
 right: 1

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13060429) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
