*** src/lib.rs:127:9: replace Bundle::texture_count -> usize with 1

*** mutation diff:
--- src/lib.rs
+++ replace Bundle::texture_count -> usize with 1
@@ -119,17 +119,17 @@
 
     /// Texture descriptors, sorted by `store0_offset` ascending (the bridge
     /// order that corresponds rank-for-rank with ascending fetch streamRefs).
     pub fn textures(&self) -> &[TextureDescriptor] {
         &self.textures
     }
 
     pub fn texture_count(&self) -> usize {
-        self.textures.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn name(&self) -> &str {
         &self.name
     }
 }
 
 fn read_member(dir: &Path, member: &'static str) -> Result<Vec<u8>, Error> {

---- alias_to_a_bogus_sized_canonical_is_skipped_not_read stdout ----

thread 'alias_to_a_bogus_sized_canonical_is_skipped_not_read' (13060949) panicked at tests/parse.rs:140:5:
assertion `left == right` failed
  left: 1
 right: 0

---- alias_whose_canonical_is_itself_an_alias_yields_no_texture stdout ----

thread 'alias_whose_canonical_is_itself_an_alias_yields_no_texture' (13060950) panicked at tests/parse.rs:257:5:
assertion `left == right` failed
  left: 1
 right: 0

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13060951) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    alias_to_a_bogus_sized_canonical_is_skipped_not_read
    alias_whose_canonical_is_itself_an_alias_yields_no_texture
    opens_parses_resolves_alias_and_sorts

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
