*** src/lib.rs:131:9: replace Bundle::name -> &str with "xyzzy"

*** mutation diff:
--- src/lib.rs
+++ replace Bundle::name -> &str with "xyzzy"
@@ -123,17 +123,17 @@
         &self.textures
     }
 
     pub fn texture_count(&self) -> usize {
         self.textures.len()
     }
 
     pub fn name(&self) -> &str {
-        &self.name
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn read_member(dir: &Path, member: &'static str) -> Result<Vec<u8>, Error> {
     let p = dir.join(member);
     if !p.exists() {
         return Err(Error::MissingMember { member });
     }

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13061968) panicked at tests/parse.rs:91:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "synthetic"

failures:
    opens_parses_resolves_alias_and_sorts

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
