*** src/lib.rs:136:5: replace read_member -> Result<Vec<u8>, Error> with Ok(vec![0])

*** mutation diff:
--- src/lib.rs
+++ replace read_member -> Result<Vec<u8>, Error> with Ok(vec![0])
@@ -128,14 +128,10 @@
     }
 
     pub fn name(&self) -> &str {
         &self.name
     }
 }
 
 fn read_member(dir: &Path, member: &'static str) -> Result<Vec<u8>, Error> {
-    let p = dir.join(member);
-    if !p.exists() {
-        return Err(Error::MissingMember { member });
-    }
-    std::fs::read(&p).map_err(|source| Error::Io { path: p, source })
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }

---- alias_to_a_bogus_sized_canonical_is_skipped_not_read stdout ----

thread 'alias_to_a_bogus_sized_canonical_is_skipped_not_read' (13062971) panicked at tests/parse.rs:139:54:
called `Result::unwrap()` on an `Err` value: BadIndex("index shorter than header")

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13062975) panicked at tests/parse.rs:199:54:
called `Result::unwrap()` on an `Err` value: BadIndex("index shorter than header")

---- alias_whose_canonical_is_itself_an_alias_yields_no_texture stdout ----

thread 'alias_whose_canonical_is_itself_an_alias_yields_no_texture' (13062972) panicked at tests/parse.rs:256:54:
called `Result::unwrap()` on an `Err` value: BadIndex("index shorter than header")

failures:
    alias_to_a_bogus_sized_canonical_is_skipped_not_read
    alias_whose_canonical_is_itself_an_alias_yields_no_texture
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 1 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
