*** src/lib.rs:137:8: delete ! in read_member

*** mutation diff:
--- src/lib.rs
+++ delete ! in read_member
@@ -129,13 +129,13 @@
 
     pub fn name(&self) -> &str {
         &self.name
     }
 }
 
 fn read_member(dir: &Path, member: &'static str) -> Result<Vec<u8>, Error> {
     let p = dir.join(member);
-    if !p.exists() {
+    if  /* ~ changed by cargo-mutants ~ */p.exists() {
         return Err(Error::MissingMember { member });
     }
     std::fs::read(&p).map_err(|source| Error::Io { path: p, source })
 }

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13064021) panicked at tests/parse.rs:199:54:
called `Result::unwrap()` on an `Err` value: MissingMember { member: "index" }

---- alias_to_a_bogus_sized_canonical_is_skipped_not_read stdout ----

thread 'alias_to_a_bogus_sized_canonical_is_skipped_not_read' (13064017) panicked at tests/parse.rs:139:54:
called `Result::unwrap()` on an `Err` value: MissingMember { member: "index" }

---- oversized_record_count_against_short_index_is_rejected stdout ----

thread 'oversized_record_count_against_short_index_is_rejected' (13064020) panicked at tests/parse.rs:166:5:
assertion failed: matches!(err, gputrace_bundle::Error::BadIndex(_))

failures:
    alias_to_a_bogus_sized_canonical_is_skipped_not_read
    alias_whose_canonical_is_itself_an_alias_yields_no_texture
    opens_parses_resolves_alias_and_sorts
    oversized_record_count_against_short_index_is_rejected
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 0 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
