*** src/lib.rs:48:12: delete ! in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ delete ! in Bundle::open
@@ -40,17 +40,17 @@
 #[derive(Debug)]
 pub struct Bundle {
     name: String,
     textures: Vec<TextureDescriptor>,
 }
 
 impl Bundle {
     pub fn open(path: &Path) -> Result<Bundle, Error> {
-        if !path.is_dir() {
+        if  /* ~ changed by cargo-mutants ~ */path.is_dir() {
             return Err(Error::NotABundle(path.to_path_buf()));
         }
         let index = read_member(path, "index")?;
         let store0 = read_member(path, "store0")?;
 
         let header = Header::parse(&index)?;
         let rec_off = header.record_array_offset()?;
         // `record_count` is untrusted (a u32 straight from the header); bound

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13051807) panicked at tests/parse.rs:199:54:
called `Result::unwrap()` on an `Err` value: NotABundle("/var/folders/r2/hsbbw3qn07g6x3fm6ksx9yqc0000gn/T/bundle_parse_trailing_48186/synthetic.gputrace")

---- oversized_record_count_against_short_index_is_rejected stdout ----

thread 'oversized_record_count_against_short_index_is_rejected' (13051806) panicked at tests/parse.rs:166:5:
assertion failed: matches!(err, gputrace_bundle::Error::BadIndex(_))

---- alias_to_a_bogus_sized_canonical_is_skipped_not_read stdout ----

thread 'alias_to_a_bogus_sized_canonical_is_skipped_not_read' (13051803) panicked at tests/parse.rs:139:54:
called `Result::unwrap()` on an `Err` value: NotABundle("/var/folders/r2/hsbbw3qn07g6x3fm6ksx9yqc0000gn/T/bundle_parse_alias_bogus_48186/synthetic.gputrace")

failures:
    alias_to_a_bogus_sized_canonical_is_skipped_not_read
    alias_whose_canonical_is_itself_an_alias_yields_no_texture
    opens_parses_resolves_alias_and_sorts
    oversized_record_count_against_short_index_is_rejected
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 0 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
