*** src/lib.rs:64:29: replace > with < in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace > with < in Bundle::open
@@ -56,17 +56,17 @@
         // `record_count` is untrusted (a u32 straight from the header); bound
         // it by the actual index size before trusting it to size an
         // allocation - a huge claimed count with a short index is rejected
         // here rather than driving a huge `Vec::with_capacity`.
         let record_array_len = (header.record_count as usize)
             .checked_mul(RECORD_SIZE)
             .and_then(|len| rec_off.checked_add(len))
             .ok_or(Error::BadIndex("record array exceeds index size"))?;
-        if record_array_len > index.len() {
+        if record_array_len < /* ~ changed by cargo-mutants ~ */ index.len() {
             return Err(Error::BadIndex("record array exceeds index size"));
         }
         let mut records = Vec::with_capacity(header.record_count as usize);
         for i in 0..header.record_count as usize {
             let r = Record::parse_at(&index, rec_off + i * RECORD_SIZE)
                 .ok_or(Error::BadIndex("record array truncated"))?;
             records.push(r);
         }

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13052803) panicked at tests/parse.rs:199:54:
called `Result::unwrap()` on an `Err` value: BadIndex("record array exceeds index size")

failures:
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
