*** src/lib.rs:64:29: replace > with >= in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace > with >= in Bundle::open
@@ -56,17 +56,17 @@
         // `record_count` is untrusted (a u32 straight from the header); bound
         // it by the actual index size before trusting it to size an
         // allocation - a huge claimed count with a short index is rejected
         // here rather than driving a huge `Vec::with_capacity`.
         let record_array_len = (header.record_count as usize)
             .checked_mul(RECORD_SIZE)
             .and_then(|len| rec_off.checked_add(len))
             .ok_or(Error::BadIndex("record array exceeds index size"))?;
-        if record_array_len > index.len() {
+        if record_array_len >= /* ~ changed by cargo-mutants ~ */ index.len() {
             return Err(Error::BadIndex("record array exceeds index size"));
         }
         let mut records = Vec::with_capacity(header.record_count as usize);
         for i in 0..header.record_count as usize {
             let r = Record::parse_at(&index, rec_off + i * RECORD_SIZE)
                 .ok_or(Error::BadIndex("record array truncated"))?;
             records.push(r);
         }

---- alias_to_a_bogus_sized_canonical_is_skipped_not_read stdout ----

thread 'alias_to_a_bogus_sized_canonical_is_skipped_not_read' (13053320) panicked at tests/parse.rs:139:54:
called `Result::unwrap()` on an `Err` value: BadIndex("record array exceeds index size")

---- alias_whose_canonical_is_itself_an_alias_yields_no_texture stdout ----

thread 'alias_whose_canonical_is_itself_an_alias_yields_no_texture' (13053321) panicked at tests/parse.rs:256:54:
called `Result::unwrap()` on an `Err` value: BadIndex("record array exceeds index size")

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13053322) panicked at tests/parse.rs:79:54:
called `Result::unwrap()` on an `Err` value: BadIndex("record array exceeds index size")

failures:
    alias_to_a_bogus_sized_canonical_is_skipped_not_read
    alias_whose_canonical_is_itself_an_alias_yields_no_texture
    opens_parses_resolves_alias_and_sorts

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
