*** src/lib.rs:69:54: replace + with - in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace + with - in Bundle::open
@@ -61,17 +61,17 @@
             .checked_mul(RECORD_SIZE)
             .and_then(|len| rec_off.checked_add(len))
             .ok_or(Error::BadIndex("record array exceeds index size"))?;
         if record_array_len > index.len() {
             return Err(Error::BadIndex("record array exceeds index size"));
         }
         let mut records = Vec::with_capacity(header.record_count as usize);
         for i in 0..header.record_count as usize {
-            let r = Record::parse_at(&index, rec_off + i * RECORD_SIZE)
+            let r = Record::parse_at(&index, rec_off - /* ~ changed by cargo-mutants ~ */ i * RECORD_SIZE)
                 .ok_or(Error::BadIndex("record array truncated"))?;
             records.push(r);
         }
         let buckets = Buckets::build(&index, &header);
         let canonical = |id: usize| buckets.as_ref().map(|b| b.canonical(id)).unwrap_or(id);
 
         // Collect every 248-byte record's payload (alias-resolved), with the
         // canonical record's store0 offset.

---- open_is_total_over_adversarial_input stdout ----
FUZZ_SEED=1 FUZZ_ITERS=200

thread 'open_is_total_over_adversarial_input' (13053780) panicked at src/lib.rs:69:46:
attempt to subtract with overflow

failures:
    open_is_total_over_adversarial_input

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
