*** src/lib.rs:69:58: replace * with + in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace * with + in Bundle::open
@@ -61,17 +61,17 @@
             .checked_mul(RECORD_SIZE)
             .and_then(|len| rec_off.checked_add(len))
             .ok_or(Error::BadIndex("record array exceeds index size"))?;
         if record_array_len > index.len() {
             return Err(Error::BadIndex("record array exceeds index size"));
         }
         let mut records = Vec::with_capacity(header.record_count as usize);
         for i in 0..header.record_count as usize {
-            let r = Record::parse_at(&index, rec_off + i * RECORD_SIZE)
+            let r = Record::parse_at(&index, rec_off + i + /* ~ changed by cargo-mutants ~ */ RECORD_SIZE)
                 .ok_or(Error::BadIndex("record array truncated"))?;
             records.push(r);
         }
         let buckets = Buckets::build(&index, &header);
         let canonical = |id: usize| buckets.as_ref().map(|b| b.canonical(id)).unwrap_or(id);
 
         // Collect every 248-byte record's payload (alias-resolved), with the
         // canonical record's store0 offset.

---- alias_to_a_bogus_sized_canonical_is_skipped_not_read stdout ----

thread 'alias_to_a_bogus_sized_canonical_is_skipped_not_read' (13054780) panicked at tests/parse.rs:139:54:
called `Result::unwrap()` on an `Err` value: BadIndex("record array truncated")

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13054784) panicked at tests/parse.rs:199:54:
called `Result::unwrap()` on an `Err` value: BadIndex("record array truncated")

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13054782) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    alias_to_a_bogus_sized_canonical_is_skipped_not_read
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
