*** src/lib.rs:80:37: replace != with == in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace != with == in Bundle::open
@@ -72,17 +72,17 @@
         }
         let buckets = Buckets::build(&index, &header);
         let canonical = |id: usize| buckets.as_ref().map(|b| b.canonical(id)).unwrap_or(id);
 
         // Collect every 248-byte record's payload (alias-resolved), with the
         // canonical record's store0 offset.
         let mut payloads: Vec<(u64, Vec<u8>)> = Vec::new();
         for (id, r) in records.iter().enumerate() {
-            if r.usize_len as usize != DESC_SIZE {
+            if r.usize_len as usize == /* ~ changed by cargo-mutants ~ */ DESC_SIZE {
                 continue;
             }
             let cid = canonical(id);
             let cr = match records.get(cid) {
                 // canonical must hold real bytes, and be a 248-byte descriptor
                 // itself - otherwise an alias could redirect to a record with
                 // an arbitrary `usize_len`, forcing a huge transient
                 // allocation in `store::read_extent`.

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13055853) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 0
 right: 3

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13055855) panicked at tests/parse.rs:200:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
