*** src/lib.rs:89:29: replace match guard !cr.is_alias(cid) && cr.usize_len as usize == DESC_SIZE with false in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace match guard !cr.is_alias(cid) && cr.usize_len as usize == DESC_SIZE with false in Bundle::open
@@ -81,17 +81,17 @@
                 continue;
             }
             let cid = canonical(id);
             let cr = match records.get(cid) {
                 // canonical must hold real bytes, and be a 248-byte descriptor
                 // itself - otherwise an alias could redirect to a record with
                 // an arbitrary `usize_len`, forcing a huge transient
                 // allocation in `store::read_extent`.
-                Some(cr) if !cr.is_alias(cid) && cr.usize_len as usize == DESC_SIZE => cr,
+                Some(cr) if false /* ~ changed by cargo-mutants ~ */ => cr,
                 _ => continue,
             };
             if let Some(p) = store::read_extent(&store0, cr.store0_offset, cr.csize, cr.usize_len)
                 && p.len() == DESC_SIZE
             {
                 payloads.push((cr.store0_offset, p));
             }
         }

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13056871) panicked at tests/parse.rs:200:5:
assertion `left == right` failed
  left: 0
 right: 1

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13056869) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
