*** src/lib.rs:89:29: delete ! in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ delete ! in Bundle::open
@@ -81,17 +81,17 @@
                 continue;
             }
             let cid = canonical(id);
             let cr = match records.get(cid) {
                 // canonical must hold real bytes, and be a 248-byte descriptor
                 // itself - otherwise an alias could redirect to a record with
                 // an arbitrary `usize_len`, forcing a huge transient
                 // allocation in `store::read_extent`.
-                Some(cr) if !cr.is_alias(cid) && cr.usize_len as usize == DESC_SIZE => cr,
+                Some(cr) if  /* ~ changed by cargo-mutants ~ */cr.is_alias(cid) && cr.usize_len as usize == DESC_SIZE => cr,
                 _ => continue,
             };
             if let Some(p) = store::read_extent(&store0, cr.store0_offset, cr.csize, cr.usize_len)
                 && p.len() == DESC_SIZE
             {
                 payloads.push((cr.store0_offset, p));
             }
         }

---- trailing_bytes_after_the_record_array_are_tolerated stdout ----

thread 'trailing_bytes_after_the_record_array_are_tolerated' (13057877) panicked at tests/parse.rs:200:5:
assertion `left == right` failed
  left: 0
 right: 1

---- opens_parses_resolves_alias_and_sorts stdout ----

thread 'opens_parses_resolves_alias_and_sorts' (13057875) panicked at tests/parse.rs:83:5:
assertion `left == right` failed
  left: 0
 right: 3

---- alias_whose_canonical_is_itself_an_alias_yields_no_texture stdout ----

thread 'alias_whose_canonical_is_itself_an_alias_yields_no_texture' (13057874) panicked at tests/parse.rs:257:5:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    alias_whose_canonical_is_itself_an_alias_yields_no_texture
    opens_parses_resolves_alias_and_sorts
    trailing_bytes_after_the_record_array_are_tolerated

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
