*** src/lib.rs:89:47: replace && with || in Bundle::open

*** mutation diff:
--- src/lib.rs
+++ replace && with || in Bundle::open
@@ -81,17 +81,17 @@
                 continue;
             }
             let cid = canonical(id);
             let cr = match records.get(cid) {
                 // canonical must hold real bytes, and be a 248-byte descriptor
                 // itself - otherwise an alias could redirect to a record with
                 // an arbitrary `usize_len`, forcing a huge transient
                 // allocation in `store::read_extent`.
-                Some(cr) if !cr.is_alias(cid) && cr.usize_len as usize == DESC_SIZE => cr,
+                Some(cr) if !cr.is_alias(cid) || /* ~ changed by cargo-mutants ~ */ cr.usize_len as usize == DESC_SIZE => cr,
                 _ => continue,
             };
             if let Some(p) = store::read_extent(&store0, cr.store0_offset, cr.csize, cr.usize_len)
                 && p.len() == DESC_SIZE
             {
                 payloads.push((cr.store0_offset, p));
             }
         }

---- alias_whose_canonical_is_itself_an_alias_yields_no_texture stdout ----

thread 'alias_whose_canonical_is_itself_an_alias_yields_no_texture' (13057343) panicked at tests/parse.rs:257:5:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    alias_whose_canonical_is_itself_an_alias_yields_no_texture

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
