*** src/store.rs:16:5: replace read_extent -> Option<Vec<u8>> with Some(vec![])

*** mutation diff:
--- src/store.rs
+++ replace read_extent -> Option<Vec<u8>> with Some(vec![])
@@ -8,29 +8,17 @@
 /// must decompress to exactly `usize_len` bytes. Returns `None` on any
 /// bounds/inflate/size failure (the caller skips such a record).
 pub(crate) fn read_extent(
     store0: &[u8],
     offset: u64,
     csize: u32,
     usize_len: u32,
 ) -> Option<Vec<u8>> {
-    let start = usize::try_from(offset).ok()?;
-    let end = start.checked_add(csize as usize)?;
-    let extent = store0.get(start..end)?;
-    let mut dec = ZlibDecoder::new(extent);
-    let mut out = vec![0u8; usize_len as usize];
-    dec.read_exact(&mut out).ok()?;
-    // The stream must end exactly here: a further byte would mean it inflated
-    // past the declared size (or ran into a following stream).
-    let mut extra = [0u8; 1];
-    match dec.read(&mut extra) {
-        Ok(0) => Some(out),
-        _ => None,
-    }
+    Some(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::read_extent;
     use flate2::{Compression, write::ZlibEncoder};
     use std::io::Write;

---- store::tests::rejects_out_of_range_extent stdout ----

thread 'store::tests::rejects_out_of_range_extent' (13087787) panicked at src/store.rs:44:9:
assertion `left == right` failed
  left: Some([])
 right: None

---- store::tests::reads_one_stream_at_an_offset stdout ----

thread 'store::tests::reads_one_stream_at_an_offset' (13087785) panicked at src/store.rs:39:9:
assertion `left == right` failed
  left: Some([])

---- store::tests::rejects_a_size_mismatch stdout ----

thread 'store::tests::rejects_a_size_mismatch' (13087786) panicked at src/store.rs:51:9:
assertion `left == right` failed
  left: Some([])
 right: None

failures:
    store::tests::reads_one_stream_at_an_offset
    store::tests::rejects_a_size_mismatch
    store::tests::rejects_out_of_range_extent

test result: FAILED. 8 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
