*** src/store.rs:26:9: delete match arm Ok(0) in read_extent

*** mutation diff:
--- src/store.rs
+++ delete match arm Ok(0) in read_extent
@@ -18,17 +18,17 @@
     let extent = store0.get(start..end)?;
     let mut dec = ZlibDecoder::new(extent);
     let mut out = vec![0u8; usize_len as usize];
     dec.read_exact(&mut out).ok()?;
     // The stream must end exactly here: a further byte would mean it inflated
     // past the declared size (or ran into a following stream).
     let mut extra = [0u8; 1];
     match dec.read(&mut extra) {
-        Ok(0) => Some(out),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::read_extent;
     use flate2::{Compression, write::ZlibEncoder};

---- store::tests::reads_one_stream_at_an_offset stdout ----

thread 'store::tests::reads_one_stream_at_an_offset' (13089251) panicked at src/store.rs:51:9:
assertion `left == right` failed
  left: None

failures:
    store::tests::reads_one_stream_at_an_offset

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
